Revit 2026 API

# DWGImportOptions(DWGImportOptions) Constructor

---

Constructs a new instance of DWGImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWGImportOptions(
	DWGImportOptions option
)
```
```vb
Public Sub New (
	option As DWGImportOptions
)
```
```cpp
public:
DWGImportOptions(
	DWGImportOptions^ option
)
```
```fsharp
new :
        option : DWGImportOptions -> DWGImportOptions
```

#### Parameters

option DWGImportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DWGImportOptions Class

DWGImportOptions Overload

Autodesk.Revit.DB Namespace